# Session 1: Introduction to Python for Data Science

## PART 1: Introduction to Pandas


#### MINT - Machine Learning

Fernando Carazo (fcarazo@tecnun.es)

## Explain jupyter notebook

![hi](https://imgv2-2-f.scribdassets.com/img/document/361177485/original/03807b2e7f/1627102355?v=1)

## Python imports and help

In [26]:
#Import Python Libraries
import numpy as np
import scipy as sp
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# tip and wait
# shift + tab
pd.DataFrame()

## Python basic data types

In [27]:
list1 = [1,2,3,4]
list2 = ['a', 'b','c','d']
tuple1 = (1,2,3,4)
dict1 = {'Name':['John', 'Peter'], 'Age': [20,25]}

print(list1)
print(list2)
print(tuple1)
print(dict1)

[1, 2, 3, 4]
['a', 'b', 'c', 'd']
(1, 2, 3, 4)
{'Name': ['John', 'Peter'], 'Age': [20, 25]}

In [28]:
list1[0]

1

In [29]:
list2[1:3]

['b', 'c']

Pandas is a python package that deals mostly with :
- **Series**  (1d homogeneous array)
- **DataFrame** (2d labeled heterogeneous array)

# Pandas Series

#### -> go to cheatsheet

Pandas *Series* is one-dimentional labeled array containing data of the same type (integers, strings, floating point numbers, Python objects, etc. ). The axis labels are often referred to as *index*.

In [45]:
# Example of creating Pandas series :
s1 = pd.Series( [-3,-1,1,3,5] )
print(s1)

0   -3
1   -1
2    1
3    3
4    5
dtype: int64

We did not pass any index, so by default, it assigned the indexes ranging from 0 to len(data)-1

In [46]:
# View index values
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [47]:
# Creating Pandas series with index:
s2 = pd.Series( np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'] )
print(s2)

a    0.213888
b    0.327660
c   -1.201392
d    1.438037
e    2.398935
dtype: float64

In [48]:
# View index values
print(s2.index)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

# Pandas DataFrame

Pandas *DataFrame* is two-dimensional, size-mutable, heterogeneous tabular data structure with labeled rows and columns ( axes ). Can be thought of a dictionary-like container to store python Series objects.

In [49]:
dic = { 'Name': ['Alice','Bob','Chris'], 'Age': [21,25,23] }

In [50]:
d =  pd.DataFrame(dic)
d

    Name  Age
0  Alice   21
1    Bob   25
2  Chris   23

> Find another way to create a DataFrame (use help)

In [ ]:
pd.DataFrame()

### Column selection

In [52]:
#Add a new column:
d['height'] = [5.2,6.0,5.6]
d

    Name  Age  height
0  Alice   21     5.2
1    Bob   25     6.0
2  Chris   23     5.6

In [53]:
#Read csv file
df = pd.read_csv("./data/Salaries.csv")

In [54]:
#Display a few first records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

### Atributes

![image.png](img/dfAtributeS.PNG)

---
*Exercise*

In [55]:
df["rank"].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

> Test the atributes!

---

In [130]:
#Identify the type of df object
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [60]:
#Check the type of a column "salary"
df['salary'].dtype

dtype('int64')

In [61]:
#List the types of all columns
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [62]:
#List the column names
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [63]:
#List the row labels and the column names
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [64]:
df.index

RangeIndex(start=0, stop=78, step=1)

In [65]:
#Number of dimensions
df.ndim

2

In [66]:
#Total number of elements in the Data Frame
df.size

468

In [67]:
#Number of rows and columns
df.shape

(78, 6)

## Methods

![image.png](img/dfMethods.PNG)

In [24]:
#Output basic statistics for the numeric columns
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [93]:
#Calculate mean for all numeric columns
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

---
*Exercise*

In [56]:
#Display first 20 records see help of the method .head()
# <your code goes here>

In [57]:
#Find how many records this data frame has;
# <your code goes here>

In [58]:
#Display the last 5 records find it on the web! ;)
# <your code goes here>

In [26]:
#Calculate the standard deviation (std() method) for all numeric columns
# <your code goes here>
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [27]:
#Calculate average of the columns in the first 50 rows
# <your code goes here>

---
## Data slicing

In [71]:
#Extract a column by name (method 1)
df['sex'].head()

0    Male
1    Male
2    Male
3    Male
4    Male
Name: sex, dtype: object

In [72]:
#Select column salary
df1 = df['salary']

In [73]:
#Check data type of the result
type(df1)

pandas.core.series.Series

In [74]:
#Look at the first few elements of the output
df1.head()

0    186960
1     93000
2    110515
3    131205
4    104800
Name: salary, dtype: int64

In [80]:
#Select column salary and make the output to be a data frame
df2 = df[['salary']]

In [76]:
#Check the type
type(df2)

pandas.core.frame.DataFrame

In [ ]:
# Select salary and phd

In [56]:
#Select a subset of rows (based on their position):
# Note 1: The location of the first row is 0
# Note 2: The last value in the range is not included
df[0:10]

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

#### loc and iloc! 

If we want to select both rows and columns BY NAME we can use method .loc

In [82]:
#If we want to select both rows and columns we can use method .loc
df.loc[10:20,['rank', 'sex','salary']]

        rank   sex  salary
10      Prof  Male  128250
11      Prof  Male  134778
12  AsstProf  Male   88000
13      Prof  Male  162200
14      Prof  Male  153750
15      Prof  Male  150480
16  AsstProf  Male   75044
17  AsstProf  Male   92000
18      Prof  Male  107300
19      Prof  Male  150500
20  AsstProf  Male   92000

In [83]:
df.loc[1:10, "salary"]

1      93000
2     110515
3     131205
4     104800
5     122400
6      81285
7     126300
8      94350
9      57800
10    128250
Name: salary, dtype: int64

In [85]:
#Let's see what we get for our df_sub data frame
# Method .loc subset the data frame based on the labels:
df.loc[10:20,['rank','sex','salary']]

        rank   sex  salary
10      Prof  Male  128250
11      Prof  Male  134778
12  AsstProf  Male   88000
13      Prof  Male  162200
14      Prof  Male  153750
15      Prof  Male  150480
16  AsstProf  Male   75044
17  AsstProf  Male   92000
18      Prof  Male  107300
19      Prof  Male  150500
20  AsstProf  Male   92000

In [87]:
#  Unlike method .loc, method iloc selects rows (and columns) by poistion:
df.iloc[10:20, [0,3,4,5]]

        rank  service   sex  salary
10      Prof       33  Male  128250
11      Prof       23  Male  134778
12  AsstProf        0  Male   88000
13      Prof       33  Male  162200
14      Prof       19  Male  153750
15      Prof        3  Male  150480
16  AsstProf        3  Male   75044
17  AsstProf        0  Male   92000
18      Prof        7  Male  107300
19      Prof       27  Male  150500

---
## Filtering

In [105]:
#Select observation with the value in the salary column > 120K
df_sub = df[ df['salary'] > 120000]
df_sub.head()

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
5   Prof          A   20       20  Male  122400
7   Prof          A   18       18  Male  126300
10  Prof          B   39       33  Male  128250

In [107]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [46]:
df_sub.axes

[Int64Index([ 0,  3,  5,  7, 10, 11, 13, 14, 15, 19, 26, 27, 29, 31, 35, 36, 39,
             40, 44, 45, 49, 51, 58, 72, 75],
            dtype='int64'),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [47]:
#Select data for female professors
df_w = df[ df['sex'] == 'Female']
df_w.head()

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000

---
*Exercise*

In [64]:
# Using filtering, find the mean value of the salary for the discipline A
df[ df['discipline'] =='A'].mean().round(2)

phd           21.53
service       15.72
salary     98331.11
dtype: float64

In [50]:
# Challange:
# Extract (filter) only observations with high salary ( > 100K) and find how many female and male professors in each group

df[df["salary"] > 100000].groupby(["sex"])["salary"].count()

sex
Female    21
Male      25
Name: salary, dtype: int64

## Sorting the Data

In [63]:
#Sort the data frame by yrs.service and create a new data frame
df_sorted = df.sort_values(by = 'service')
df_sorted.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [64]:
#Sort the data frame by yrs.service and overwrite the original dataset
df.sort_values(by = 'service', ascending = False, inplace = True)
df.head()

    rank discipline  phd  service     sex  salary
9   Prof          A   51       51    Male   57800
0   Prof          B   56       49    Male  186960
36  Prof          B   45       45    Male  146856
27  Prof          A   45       43    Male  155865
40  Prof          A   39       36  Female  137000

In [65]:
# Restore the original order (by sorting using index)
df.sort_index(axis=0, ascending = True, inplace = True)
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

*Exercise*

In [69]:
# Sort data frame by the salary (in descending order) and display the first few records of the output (head)
df.sort_values(by="salary", ascending=False)[0:10]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
72  Prof          B   24       15  Female  161101
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750
14  Prof          B   25       19    Male  153750
44  Prof          B   23       19  Female  151768
19  Prof          A   29       27    Male  150500
15  Prof          B   17        3    Male  150480
26  Prof          A   38       19    Male  148750

---

In [70]:
#Sort the data frame using 2 or more columns:
df_sorted = df.sort_values(by = ['service', 'salary'], ascending = [True,False])
df_sorted.head(10)

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
28  AsstProf          B    7        2    Male   91300
42  AsstProf          B    4        2  Female   80225
68  AsstProf          A    4        2  Female   77500

## ----
## Grouping and summarizing

In [94]:
#Group data using rank
df_rank = df.groupby(['rank'])

In [95]:
df_rank

In [96]:
#Calculate mean of all numeric columns for the grouped object
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

### ---
### Common Aggregation Functions:

|Function|Description
|-------|--------
|min   | minimum
|max   | maximum
|count   | number of non-null observations
|sum   | sum of values
|mean  | arithmetic mean of values
|median | median
|mad | mean absolute deviation
|mode | mode
|prod   | product of values
|std  | standard deviation
|var | unbiased variance

In [98]:
df.groupby('sex').mean()

              phd    service         salary
sex
Female  16.512821  11.564103  101002.410256
Male    22.897436  18.538462  115045.153846

In [99]:
#Calculate the mean salary for men and women. The following produce Pandas Series (single brackets around salary)
df.groupby('sex')['salary'].mean()

sex
Female    101002.410256
Male      115045.153846
Name: salary, dtype: float64

In [100]:
# If we use double brackets Pandas will produce a DataFrame
df.groupby('sex')[['salary']].mean()

               salary
sex
Female  101002.410256
Male    115045.153846

In [103]:
# Group using 2 variables - sex and rank:
df.groupby(['rank','sex']).mean()

                        phd    service         salary
rank      sex
AssocProf Female  15.500000  11.500000   88512.800000
          Male    13.666667  10.666667  102697.666667
AsstProf  Female   5.636364   2.545455   78049.909091
          Male     4.250000   1.750000   85918.000000
Prof      Female  23.722222  17.111111  121967.611111
          Male    29.214286  24.178571  124690.142857

---
*Exercise*

In [40]:
# Group data by the discipline and find the average salary for each group

                   salary
discipline
A            98331.111111
B           116331.785714

---
*Exercise*

In [29]:
#Calculate the basic statistics for the salary column (used describe() method)
# <your code goes here>

In [30]:
#Calculate how many teachers there are by category and sex (use count() method)
# <your code goes here>

78

# Keep Learnign: more material and tutorials

The best way to learn the material is to execute the code and experiment with it yourself. Check out other tutorials here: 

1. [First Steps with Python and Jupyter](https://jovian.ai/aakashns/first-steps-with-python)
2. [A Quick Tour of Variables and Data Types](https://jovian.ai/aakashns/python-variables-and-data-types)
3. [Branching using Conditional Statements and Loops](https://jovian.ai/aakashns/python-branching-and-loops)
4. [Writing Reusable Code Using Functions](https://jovian.ai/aakashns/python-functions-and-scope)
5. [Reading from and Writing to Files](https://jovian.ai/aakashns/python-os-and-filesystem)
6. [Numerical Computing with Python and Numpy](https://jovian.ai/aakashns/python-numerical-computing-with-numpy)
7. [Analyzing Tabular Data using Pandas](https://jovian.ai/aakashns/python-pandas-data-analysis)
8. [Data Visualization using Matplotlib & Seaborn](https://jovian.ai/aakashns/python-matplotlib-data-visualization)
9. [Exploratory Data Analysis - A Case Study](https://jovian.ai/aakashns/python-eda-stackoverflow-survey)